{
  "experiences": [
    {
      "logo": "globaltask",
      "name": "Local Freelance Project",
      "organization": "Local Freelance",
      "mainRole": "full.stack developer",
      "description": "Revamped the UI and user flow of a Vue.js application, improving accessibility and design consistency.\nOverhauled the gift box creation process, optimizing the step-by-step interface and backend interactions.\nWorked within a CMS-like environment, ensuring smooth content updates and scalable architecture.\nEngaged in agile development with an English-speaking team, collaborating on features and performance optimizations. \n Designed and developed a React Native app for employees to declare corporate credit card expenses.\nImplemented a receipt photo upload feature, allowing users to attach images for company review.\nEnsured smooth data synchronization and API integration for real-time expense tracking.\nFocused on a responsive and intuitive UI, improving usability and accessibility.",
      "roleStack": {
        "frontend": ["typescript", "nextjs", "redux", "shopify", "cordoba"],
        "backend": ["nodejs", "postgreSQL", "nextjs", "redux"],
        "management": ["git", "jira", "bitbucket"],
        "experienceType": "freelance"
      }
    },
    {
      "logo": "globant",
      "name": "Local Freelance Project",
      "organization": "Local Freelance",
      "mainRole": "full.stack developer",
      "description": "Enhanced and maintained a Next.js-based portal enabling employees to access tertiary education as a corporate benefit.\nRefactored and updated the API, ensuring seamless data retrieval and integration with internal systems.\nDeveloped and executed bulk MongoDB update scripts to migrate and manage large datasets efficiently.\nDesigned and implemented new sections and improved the main enrollment flow, streamlining the user experience.\nCollaborated with an English-speaking team, ensuring smooth development and feature delivery.",
      "roleStack": {
        "frontend": ["typescript", "nextjs", "redux", "shopify", "cordoba"],
        "backend": ["nodejs", "postgreSQL", "nextjs", "redux"],
        "management": ["react", "typescript", "nextjs", "redux"],
        "experienceType": "freelance"
      }
    },
    {
      "logo": "thestartup",
      "name": "Local Freelance Project",
      "organization": "Local Freelance",
      "mainRole": "full.stack developer",
      "description": "Led a UI overhaul, modernizing the platform’s design, improving responsiveness, and enhancing the overall user experience.\nDeveloped and integrated a new user hub, allowing users to connect, request guidance, and access economic incentives.\nUpdated and optimized API endpoints to ensure seamless communication between frontend and backend services.\nWorked closely with an English-speaking team, contributing to agile development, UI/UX decisions, and performance improvements.",
      "roleStack": {
        "frontend": ["typescript", "nextjs", "redux", "shopify", "cordoba"],
        "backend": ["nodejs", "postgreSQL", "nextjs", "redux"],
        "management": ["react", "typescript", "nextjs", "redux"],
        "experienceType": "freelance"
      }
    },
    {
      "logo": "globallogic",
      "name": "Local Freelance Project",
      "organization": "Local Freelance",
      "mainRole": "full.stack developer",
      "description": "Developed and maintained a Next.js-based streaming platform using a micro-frontend architecture, ensuring modular and scalable code.\nImplemented new pages and features, optimized existing ones, and enhanced the manifest schema to improve content delivery and user experience.\nCollaborated with a multinational, English-speaking team, actively participating in discussions, code reviews, and agile development processes.\nContributed to performance optimizations and UI improvements, ensuring seamless streaming experiences across devices.",
      "roleStack": {
        "frontend": ["typescript", "nextjs", "redux", "shopify", "cordoba"],
        "backend": ["nodejs", "postgreSQL", "nextjs", "redux"],
        "management": ["react", "typescript", "nextjs", "redux"],
        "experienceType": "freelance"
      }
    },
    {
      "logo": "kyosk",
      "name": "Local Freelance Project",
      "organization": "Local Freelance",
      "mainRole": "full.stack developer",
      "description": "Developed a web and mobile application enabling writers and scriptwriters to create, update, and share their projects with publishers for feedback and approval.\nDesigned and implemented a specialized system for graphic novel scriptwriters, allowing them to format and present content distinct from traditional writing.\nOptimized the collaboration workflow, ensuring seamless communication between creators and publishers.",
      "roleStack": {
        "frontend": [
          "reactNative",
          "expo",
          "typescript",
          "tailwindCSS",
          "tamagui",
          "nextjs"
        ],
        "backend": ["mongoDB", "payload", "nodejs", "redux"],
        "management": ["jira", "cloudflare"],
        "experienceType": "freelance"
      }
    },
    {
      "logo": "freelance",
      "name": "Local Freelance Project",
      "organization": "Local Freelance",
      "mainRole": "full.stack developer",
      "description": "A platform that allows entrepreneurs and organizations to connect and find a match in project funding.",
      "roleStack": {
        "frontend": ["typescript", "nextjs", "redux", "shopify", "cordoba"],
        "backend": ["nodejs", "postgreSQL", "nextjs", "redux"],
        "management": ["react", "typescript", "nextjs", "redux"],
        "experienceType": "freelance"
      }
    }
  ]
}
